Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/gitlab.tmx
Source language: en
Languages: sv

source: BranchRules|Deploy keys
sv: Grenregler|Driftsättningsnycklar

source: CI configuration validated, including all configuration added with the %{codeStart}include%{codeEnd} keyword. %{link}
sv: CI-konfigurationen har validerats, inklusive all konfiguration som lagts till med nyckelordet %{codeStart}include%{codeEnd}. %{link}

source: CiCatalog|Search keyword must have at least 3 characters
sv: CI-katalog|Sökordet måste innehålla minst 3 tecken

source: CiVariables|A variable key can only contain letters, numbers, and '_'.
sv: CI-variabler|En variabelnyckel får bara innehålla bokstäver, siffror och '_'.

source: CiVariables|Do you want to delete the variable %{key}?
sv: CI-variabler|Vill du ta bort variabeln %{key}?

source: CiVariables|Input variable key
sv: CI-variabler|Inmatningsvariabelnyckel

source: CiVariables|Key
sv: CI-variabler|Nyckel

source: CiVariables|Variable key
sv: CI-variabler|Variabelnyckel

source: CiVariable|Variable %{key} has been deleted.
sv: CI-variabel|Variabeln %{key} har tagits bort.

source: CiVariable|Variable %{key} has been successfully added.
sv: CI-variabel|Variabeln %{key} har lagts till.

source: CiVariable|Variable %{key} has been updated.
sv: CI-variabel|Variabeln %{key} har uppdaterats.

source: ClusterAgents|%{number} of %{total} clusters connected through cluster certificates
sv: Klusteragenter|%{number} av %{total} kluster är anslutna via klustercertifikat

source: ClusterAgents|Connect a cluster (certificate - deprecated)
sv: Klusteragenter|Anslut ett kluster (certifikat – föråldrat)

source: ClusterAgents|No clusters connected through cluster certificates
sv: Klusteragenter|Inga kluster är anslutna via klustercertifikat

source: ClusterIntegration|CA Certificate
sv: Klusterintegrering|CA-certifikat

source: ClusterIntegration|Check your CA certificate
sv: Klusterintegrering|Kontrollera ditt CA-certifikat

source: ClusterIntegration|Connect your cluster to GitLab through %{linkStart}cluster certificates%{linkEnd}.
sv: Klusterintegrering|Anslut ditt kluster till GitLab med %{linkStart}klustercertifikat%{linkEnd}.

source: ClusterIntegration|Copy CA Certificate
sv: Klusterintegrering|Kopiera CA-certifikat

source: ClusterIntegration|The certificate-based method to connect clusters to GitLab was %{linkStart}deprecated%{linkEnd} in GitLab 14.5.
sv: Klusterintegrering|Den certifikatbaserade metoden för att ansluta kluster till GitLab blev %{linkStart}föråldrad%{linkEnd} i GitLab 14.5.

source: CodeownersValidation|Contains owners which are not accessible within the project
sv: Validering av kodägare|Innehåller ägare som inte är åtkomliga inom projektet

source: CodeownersValidation|Group needs at least Developer access to the project for its members to approve merge requests
sv: Validering av kodägare|Gruppen behöver minst åtkomstnivån Utvecklare för att dess medlemmar ska kunna godkänna sammanfogningsbegäranden

source: CodeownersValidation|Inaccessible owners
sv: Validering av kodägare|Otillgängliga ägare

source: CascadingSettings|This setting has been enforced by an owner of %{link}.
sv: Kaskadinställningar|Den här inställningen har tvingats igenom av en ägare till %{link}.

source: CiCatalog|Private - This component project can only be viewed by project members.
sv: CI-katalog|Privat – det här komponentprojektet kan bara visas av projektmedlemmar.

source: CiVariables|Default role to use pipeline variables
sv: CI-variabler|Standardroll för användning av pipelinevariabler

source: CiVariables|Minimum role to use pipeline variables
sv: CI-variabler|Minsta roll för användning av pipelinevariabler

source: CiVariables|Pipeline variable minimum override role successfully updated.
sv: CI-variabler|Den lägsta åsidosättningsrollen för pipelinevariabler har uppdaterats.

source: CiVariables|Select the default minimum role to use in new projects, to run a new pipeline with pipeline variables.
sv: CI-variabler|Välj den lägsta standardrollen som ska användas i nya projekt för att köra en ny pipeline med pipelinevariabler.

source: CiVariables|Select the minimum role that is allowed to run a new pipeline with pipeline variables.
sv: CI-variabler|Välj den lägsta roll som får köra en ny pipeline med pipelinevariabler.

source: CiVariables|There was a problem fetching the pipeline variables default role.
sv: CI-variabler|Det gick inte att hämta standardrollen för pipelinevariabler.

source: CiVariables|There was a problem updating the pipeline variables default role setting.
sv: CI-variabler|Det gick inte att uppdatera inställningen för standardrollen för pipelinevariabler.

source: ClusterAgents|Requires a Maintainer or greater role to delete agents
sv: Klusteragenter|Kräver rollen Underhållare eller högre för att ta bort agenter

source: ClusterAgents|Requires a Maintainer or greater role to perform these actions
sv: Klusteragenter|Kräver rollen Underhållare eller högre för att utföra de här åtgärderna

source: ClusterAgents|Requires a Maintainer or greater role to perform this action
sv: Klusteragenter|Kräver rollen Underhållare eller högre för att utföra den här åtgärden

source: CodeOwners|Assign users and groups as approvers for specific file changes.
sv: Kodägare|Tilldela användare och grupper som godkännare för specifika filändringar.

source: CodeOwner|Pattern
sv: Kodägare|Mönster

source: CodeownersValidation|An error occurred while loading the validation errors. Please try again later.
sv: Validering av kodägare|Ett fel uppstod när valideringsfelen skulle läsas in. Försök igen senare.

source: CodeownersValidation|Entries with spaces
sv: Validering av kodägare|Poster med blanksteg

source: CodeownersValidation|How are errors handled?
sv: Validering av kodägare|Hur hanteras fel?

source: CodeownersValidation|Less than 1 required approvals
sv: Validering av kodägare|Färre än 1 obligatoriskt godkännande

source: CodeownersValidation|Line
sv: Validering av kodägare|Rad

source: CodeownersValidation|Malformed owners
sv: Validering av kodägare|Felaktigt formaterade ägare

source: CodeownersValidation|Missing section name
sv: Validering av kodägare|Saknat avsnittsnamn

source: CodeownersValidation|Unparsable sections
sv: Validering av kodägare|Avsnitt som inte kan tolkas

source: CodeownersValidation|Zero owners
sv: Validering av kodägare|Noll ägare

source: CommitSignature|This commit was signed with a key that has expired.
sv: Commit-signatur|Den här committen signerades med en nyckel som har gått ut.

source: CommitSignature|This commit was signed with a key that was revoked.
sv: Commit-signatur|Den här committen signerades med en nyckel som har återkallats.

source: ContinuousDeployment|It may have been removed or you may not have access to it.
sv: Kontinuerlig driftsättning|Den kan ha tagits bort eller så har du inte åtkomst till den.

source: BeyondIdentityService|If enabled, Beyond Identity will not check commits from %{docs_link}.
sv: Tjänsten Beyond Identity|Om funktionen aktiveras kontrollerar Beyond Identity inte commits från %{docs_link}.

source: BeyondIdentityService|If enabled, Beyond Identity will not check commits from service accounts.
sv: Tjänsten Beyond Identity|Om funktionen aktiveras kontrollerar Beyond Identity inte commits från tjänstkonton.

source: Branch %{branch_name} was created. To set up auto deploy, choose a GitLab CI Yaml template and commit your changes. %{link_to_autodeploy_doc}
sv: Grenen %{branch_name} har skapats. För att konfigurera automatisk driftsättning väljer du en GitLab CI-YAML-mall och checkar in ändringarna. %{link_to_autodeploy_doc}

source: ClusterAgents|The agent version do not match each other across your cluster's pods. This can happen when a new agent version was just deployed and Kubernetes is shutting down the old pods.
sv: Klusteragenter|Agentversionerna matchar inte varandra mellan klustrets poddar. Det kan hända när en ny agentversion precis har driftsatts och Kubernetes stänger av de gamla poddarna.

source: ClusterIntegration|Use the %{linkStart}GitLab agent%{linkEnd} to safely connect your Kubernetes clusters to GitLab. You can deploy your applications, run your pipelines, use Review Apps, and much more.
sv: Klusterintegrering|Använd %{linkStart}GitLab-agenten%{linkEnd} för att ansluta dina Kubernetes-kluster säkert till GitLab. Du kan driftsätta program, köra pipelines, använda granskningsappar och mycket mer.

source: CommitSignature|Unverified
sv: Commit-signatur|Overifierad

source: CommitSignature|Unverified signature
sv: Commit-signatur|Overifierad signatur

source: Configure pipelines to deploy web apps, backend services, APIs and static resources to Google Cloud
sv: Konfigurera pipelines för att driftsätta webbappar, backendtjänster, API:er och statiska resurser till Google Cloud

source: Configure your Git identity
sv: Konfigurera din Git-identitet

source: Configure your Git identity globally to use it for all current and future projects on your machine:
sv: Konfigurera din Git-identitet globalt för att använda den för alla aktuella och framtida projekt på datorn:

source: Configure your Git identity locally to use it only for this project:
sv: Konfigurera din Git-identitet lokalt för att använda den endast för det här projektet:

source: Configure your environments to be deployed to specific geographical regions
sv: Konfigurera dina miljöer så att de driftsätts i specifika geografiska regioner

source: ContinuousDeployment|Deployed
sv: Kontinuerlig driftsättning|Driftsatt

source: ContinuousDeployment|Deploying
sv: Kontinuerlig driftsättning|Driftsätter

source: ContinuousDeployment|Deployment ID
sv: Kontinuerlig driftsättning|Driftsättnings-ID

source: ContinuousDeployment|Deployments
sv: Kontinuerlig driftsättning|Driftsättningar

source: ContinuousDeployment|Description
sv: Kontinuerlig driftsättning|Beskrivning

source: ContinuousDeployment|Development
sv: Kontinuerlig driftsättning|Utveckling

source: ContinuousDeployment|Digest
sv: Kontinuerlig driftsättning|Kontrollsumma

source: ContinuousDeployment|Edit
sv: Kontinuerlig driftsättning|Redigera

source: ContinuousDeployment|Environment identity
sv: Kontinuerlig driftsättning|Miljöidentitet

source: ContinuousDeployment|Environment name
sv: Kontinuerlig driftsättning|Miljönamn

source: ContinuousDeployment|Environments
sv: Kontinuerlig driftsättning|Miljöer

source: ContinuousDeployment|Environments are places where code gets deployed, such as staging or production.
sv: Kontinuerlig driftsättning|Miljöer är platser där kod driftsätts, till exempel mellanlagring eller produktion.

source: ContinuousDeployment|Expand deployments
sv: Kontinuerlig driftsättning|Visa driftsättningar

source: ContinuousDeployment|Expand links
sv: Kontinuerlig driftsättning|Visa länkar

source: ContinuousDeployment|Expand releases
sv: Kontinuerlig driftsättning|Visa utgåvor

source: ContinuousDeployment|Expand services
sv: Kontinuerlig driftsättning|Visa tjänster

source: ContinuousDeployment|Failed to load GitLab agents. Refresh the page to try again.
sv: Kontinuerlig driftsättning|Det gick inte att läsa in GitLab-agenter. Uppdatera sidan och försök igen.

source: ContinuousDeployment|Failed to load deployments. Reload to try again.
sv: Kontinuerlig driftsättning|Det gick inte att läsa in driftsättningarna. Ladda om och försök igen.

source: ContinuousDeployment|Failed to load releases. Reload to try again.
sv: Kontinuerlig driftsättning|Det gick inte att läsa in utgåvorna. Ladda om och försök igen.

source: ContinuousDeployment|Failed to load the application. Please try again later.
sv: Kontinuerlig driftsättning|Det gick inte att läsa in programmet. Försök igen senare.

source: ContinuousDeployment|Failed to trigger the deployment. Please try again.
sv: Kontinuerlig driftsättning|Det gick inte att utlösa driftsättningen. Försök igen.

source: ContinuousDeployment|Filter deployments…
sv: Kontinuerlig driftsättning|Filtrera driftsättningar…

source: ContinuousDeployment|Flow editor
sv: Kontinuerlig driftsättning|Flödesredigerare

source: ContinuousDeployment|Get started with environments
sv: Kontinuerlig driftsättning|Kom igång med miljöer

source: ContinuousDeployment|In progress
sv: Kontinuerlig driftsättning|Pågår

source: ContinuousDeployment|Kubernetes (Argo Rollouts)
sv: Kontinuerlig driftsättning|Kubernetes (Argo Rollouts)

source: ContinuousDeployment|Last deploy
sv: Kontinuerlig driftsättning|Senaste driftsättning

source: ContinuousDeployment|Last deployed
sv: Kontinuerlig driftsättning|Senast driftsatt

source: ContinuousDeployment|Last deployed %{time}
sv: Kontinuerlig driftsättning|Senast driftsatt %{time}

source: ContinuousDeployment|Name (e.g. api-gateway)
sv: Kontinuerlig driftsättning|Namn (t.ex. api-gateway)

source: ContinuousDeployment|No deployments available.
sv: Kontinuerlig driftsättning|Inga driftsättningar är tillgängliga.

source: ContinuousDeployment|No deployments match your filter.
sv: Kontinuerlig driftsättning|Inga driftsättningar matchar ditt filter.

source: ContinuousDeployment|No services in this release.
sv: Kontinuerlig driftsättning|Inga tjänster i den här utgåvan.

source: ContinuousDeployment|No versions recorded.
sv: Kontinuerlig driftsättning|Inga versioner har registrerats.

source: ContinuousDeployment|Pending
sv: Kontinuerlig driftsättning|Väntar

source: ContinuousDeployment|Register environment
sv: Kontinuerlig driftsättning|Registrera miljö

source: ContinuousDeployment|Register the cluster or cloud account where services will run. Agent registration is included.
sv: Kontinuerlig driftsättning|Registrera klustret eller molnkontot där tjänsterna ska köras. Agentregistrering ingår.

source: ContinuousDeployment|Register your first environment
sv: Kontinuerlig driftsättning|Registrera din första miljö

source: ContinuousDeployment|Release
sv: Kontinuerlig driftsättning|Utgåva

source: ContinuousDeployment|Release not found
sv: Kontinuerlig driftsättning|Utgåvan hittades inte

source: Allow %{strongOpen}%{provider}%{strongClose} to sign you in?
sv: Tillåt %{strongOpen}%{provider}%{strongClose} att logga in dig?

source: Assign reviewers
sv: Tilldela granskare

source: Assignees & reviewers
sv: Tilldelade och granskare

source: Attestations|Build Signer Digest
sv: Attesteringar|Kontrollsumma för byggsignerare

source: Attestations|Build Signer URI
sv: Attesteringar|URI för byggsignerare

source: Automatically sign commits made through the web interface.
sv: Signera automatiskt incheckningar som görs via webbgränssnittet.

source: Awaiting user signup
sv: Väntar på användarregistrering

source: Billings|Credit card has exceeded the daily verification limit. Use a different card or try again later.
sv: Faktureringsinställningar|Kreditkortet har överskridit den dagliga verifieringsgränsen. Använd ett annat kort eller försök igen senare.

source: BulkImport|Items assigned to placeholder users have been reassigned to users in %{strong_open}%{group}%{strong_close} according to the uploaded CSV file.
sv: Massimport|Objekt som tilldelats platshållaranvändare har tilldelats om till användare i %{strong_open}%{group}%{strong_close} enligt den uppladdade CSV-filen.

source: BulkImport|Placeholder reassignments completed successfully
sv: Massimport|Omtilldelningarna av platshållare slutfördes

source: BulkImport|Placeholder reassignments completed with errors
sv: Massimport|Omtilldelningarna av platshållare slutfördes med fel

source: BulkImport|Unable to process the CSV file for %{strong_open}%{group}%{strong_close} to reassign placeholders. Try to upload the file again.
sv: Massimport|Det gick inte att bearbeta CSV-filen för %{strong_open}%{group}%{strong_close} för att tilldela om platshållare. Försök att ladda upp filen igen.

source: Cannot assign a confidential epic to a non-confidential issue. Make the issue confidential and try again
sv: Det går inte att tilldela en konfidentiell epik till ett icke-konfidentiellt ärende. Gör ärendet konfidentiellt och försök igen

source: Cannot assign a confidential parent item to a non-confidential child item. Make the child item confidential and try again.
sv: Det går inte att tilldela ett konfidentiellt överordnat objekt till ett icke-konfidentiellt underordnat objekt. Gör det underordnade objektet konfidentiellt och försök igen.

source: Cannot make the epic confidential if it contains non-confidential child epics
sv: Det går inte att göra epiken konfidentiell om den innehåller icke-konfidentiella underordnade epiker

source: Cannot make the epic confidential if it contains non-confidential issues
sv: Det går inte att göra epiken konfidentiell om den innehåller icke-konfidentiella ärenden

source: CodeSuggestions|A user can be assigned a %{title} seat only once each billable month.
sv: Kodförslag|En användare kan bara tilldelas en %{title}-plats en gång per faktureringsmånad.

source: CodeSuggestions|Manage seat assignments for %{addOnName} within your group.
sv: Kodförslag|Hantera platstilldelningar för %{addOnName} inom din grupp.

source: CodeSuggestions|Manage seat assignments for %{addOnName}.
sv: Kodförslag|Hantera platstilldelningar för %{addOnName}.

source: CodeSuggestions|The GitLab Duo Agent Platform service must be accessible for agentic workflows.
sv: Kodförslag|Tjänsten GitLab Duo Agent Platform måste vara åtkomlig för agentbaserade arbetsflöden.

source: CodeSuggestions|To buy GitLab Duo seats and regain access, you'll need a Premium or Ultimate subscription.
sv: Kodförslag|För att köpa GitLab Duo-platser och återfå åtkomst behöver du en Premium- eller Ultimate-prenumeration.

source: CodeSuggestions|You have been assigned a GitLab Duo Pro seat
sv: Kodförslag|Du har tilldelats en GitLab Duo Pro-plats

source: CodeSuggestions|You now have access to GitLab Duo Pro, which features Code Suggestions and Chat, which boost your efficiency and effectiveness by reducing the time required to write and understand code.
sv: Kodförslag|Du har nu åtkomst till GitLab Duo Pro, som innehåller Kodförslag och chatt och ökar din effektivitet genom att minska tiden det tar att skriva och förstå kod.

source: Complete verification to sign up.
sv: Slutför verifieringen för att registrera dig.

source: Confidential issue
sv: Konfidentiellt ärende

source: Confidential note
sv: Konfidentiell kommentar

source: ContinuousDeployment|The application may have been removed or you may not have access to it.
sv: Kontinuerlig driftsättning|Programmet kan ha tagits bort eller så har du inte åtkomst till det.

source: ContinuousDeployment|This deployment will honour all policies and approval gates configured for the target environments.
sv: Kontinuerlig driftsättning|Den här driftsättningen följer alla policyer och godkännandegrindar som har konfigurerats för målmiljöerna.

source: Billings|To view subscription details and manage billing, select a group.
sv: Fakturering|Välj en grupp för att visa prenumerationsinformation och hantera fakturering.

source: Billings|View subscription details and manage billing for your %{linkStart}groups%{linkEnd}.
sv: Fakturering|Visa prenumerationsinformation och hantera fakturering för dina %{linkStart}grupper%{linkEnd}.

source: Billings|Your group is on a trial of GitLab Ultimate
sv: Fakturering|Din grupp har en testperiod för GitLab Ultimate

source: Billings|Your group is on the Free plan
sv: Fakturering|Din grupp har abonnemanget Free

source: Billing|Confirm bulk seat assignment
sv: Fakturering|Inbjuden grupp

source: Billing|You have assigned all available GitLab Duo add-on seats.
sv: Fakturering|Du har tilldelat alla tillgängliga tilläggsplatser för GitLab Duo.

source: Boards|Because this is the only board in this group, when this board is deleted, a new default Development board will be created.
sv: Tavlor|Eftersom detta är den enda tavlan i gruppen skapas en ny standardtavla för utveckling när tavlan tas bort.

source: BulkImport|Import failed. The bulk import entity must belong to only one organization, group, or project.
sv: Massimport|Importen misslyckades. Massimportentiteten får bara tillhöra en organisation, grupp eller ett projekt.

source: BulkImport|Import failed. The destination cannot be a subgroup of the source group. Change the destination and try again.
sv: Massimport|Importen misslyckades. Målet får inte vara en undergrupp till källgruppen. Ändra målet och försök igen.

source: BulkImport|Import groups by direct transfer
sv: Massimport|Importera grupper genom direktöverföring

source: BulkImport|Importing the group failed.
sv: Massimport|Det gick inte att importera gruppen.

source: BulkImport|Path of the new group
sv: Massimport|Sökväg för den nya gruppen

source: BulkImport|Re-import creates a new group and does not sync with the existing group.
sv: Massimport|Omimport skapar en ny grupp och synkroniserar inte med den befintliga gruppen.

source: BulkImport|Select a parent group.
sv: Massimport|Välj en överordnad grupp.

source: BulkImport|Select parent group
sv: Massimport|Välj överordnad grupp

source: BulkImport|Select the groups you want to import.
sv: Massimport|Välj de grupper du vill importera.

source: BulkImport|Some groups are imported without projects.
sv: Massimport|Vissa grupper importeras utan projekt.

source: BulkImport|This name is already used for another group.
sv: Massimport|Det här namnet används redan för en annan grupp.

source: BulkImport|Your imported groups and projects appear here.
sv: Massimport|Dina importerade grupper och projekt visas här.

source: BulkImport|must be a group.
sv: Massimport|måste vara en grupp.

source: BulkImport|must belong to a group.
sv: Massimport|måste tillhöra en grupp.

source: CascadingSettings|Enforce for all subgroups
sv: Kaskadinställningar|Tvinga igenom för alla undergrupper

source: CascadingSettings|Subgroups cannot change this setting.
sv: Kaskadinställningar|Undergrupper kan inte ändra den här inställningen.

source: %d project currently uses this profile and will be left without one.
sv: %d projekt använder för närvarande denna profil och kommer att sakna profil.

source: %d projects currently use this profile and will be left without one.
sv: %d projekt använder för närvarande denna profil och kommer att sakna profil.

source: AdminAIPoweredFeatures|When turned on, users can only use the models selected below, which always includes the currently selected default model. When turned off, users can use all available %{linkStart}GitLab-managed models%{linkEnd} (including those added in the future), unless a non-GitLab default model is set as the model for Agentic Chat, in which case users can only use that model.
sv: AdminAIPoweredFeatures|När funktionen är aktiverad kan användare bara använda modellerna som valts nedan, vilket alltid inkluderar den för närvarande valda standardmodellen. När den är avstängd kan användare använda alla tillgängliga %{linkStart}GitLab-hanterade modeller%{linkEnd} (inklusive de som läggs till i framtiden), såvida inte en standardmodell som inte är från GitLab har angetts för agentchatt. I så fall kan användare bara använda den modellen.

source: AiGovernance|%d machine
sv: AiGovernance|%d maskin

source: AiGovernance|%d machines
sv: AiGovernance|%d maskiner

source: AiGovernance|%d user
sv: AiGovernance|%d användare

source: AiGovernance|%d users
sv: AiGovernance|%d användare

source: AiOverview|%{count} unresolved thread
sv: AiOverview|%{count} olöst tråd

source: AiOverview|%{count} unresolved threads
sv: AiOverview|%{count} olösta trådar

source: AiPowered|%d check failed
sv: AiPowered|%d kontroll misslyckades

source: AiPowered|%d checks failed
sv: AiPowered|%d kontroller misslyckades

source: AiPowered|%d check passed
sv: AiPowered|%d kontroll godkändes

source: AiPowered|%d checks passed
sv: AiPowered|%d kontroller godkändes
